---
kind: property
id: P:Autodesk.Revit.ApplicationServices.Application.ShowGraphicalWarningPipeDisconnects
source: html/68da8230-c15e-bd91-42b9-90e8978fd9c5.htm
---
# Autodesk.Revit.ApplicationServices.Application.ShowGraphicalWarningPipeDisconnects Property

Whether or not to show the graphical warnings for Pipe disconnects.

## Syntax (C#)
```csharp
public bool ShowGraphicalWarningPipeDisconnects { get; set; }
```